boards/arm/tiac_magpie/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.199 (be patient).....done


Server Software:        
Server Hostname:        192.168.10.199
Server Port:            8080

Document Path:          /
Document Length:        2084 bytes

Concurrency Level:      20
Time taken for tests:   0.210 seconds
Complete requests:      100
Failed requests:        7
   (Connect: 0, Receive: 0, Length: 7, Exceptions: 0)
Total transferred:      199020 bytes
HTML transferred:       193812 bytes
Requests per second:    475.12 [#/sec] (mean)
Time per request:       42.094 [ms] (mean)
Time per request:       2.105 [ms] (mean, across all concurrent requests)
Transfer rate:          923.43 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.2      1       2
Processing:     1   18  51.4      4     206
Waiting:        0    9  34.7      3     206
Total:          2   19  51.4      5     208

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      5
  80%      5
  90%      5
  95%    204
  98%    207
  99%    208
 100%    208 (longest request)