boards/arm/tiac_magpie/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient).....done


Server Software:        
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        2084 bytes

Concurrency Level:      20
Time taken for tests:   0.264 seconds
Complete requests:      100
Failed requests:        44
   (Connect: 0, Receive: 0, Length: 41, Exceptions: 3)
Total transferred:      126260 bytes
HTML transferred:       122956 bytes
Requests per second:    379.27 [#/sec] (mean)
Time per request:       52.733 [ms] (mean)
Time per request:       2.637 [ms] (mean, across all concurrent requests)
Transfer rate:          467.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   11  22.3      7     109
Processing:     2   24  30.9     21     137
Waiting:        0    6  12.3      7     121
Total:          3   36  34.7     29     141

Percentage of the requests served within a certain time (ms)
  50%     29
  66%     29
  75%     29
  80%     29
  90%    114
  95%    122
  98%    124
  99%    141
 100%    141 (longest request)