boards/arm/tiac_magpie/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.197 (be patient).....done


Server Software:        
Server Hostname:        192.168.10.197
Server Port:            8080

Document Path:          /
Document Length:        2084 bytes

Concurrency Level:      20
Time taken for tests:   0.267 seconds
Complete requests:      100
Failed requests:        46
   (Connect: 0, Receive: 0, Length: 42, Exceptions: 4)
Total transferred:      124120 bytes
HTML transferred:       120872 bytes
Requests per second:    374.56 [#/sec] (mean)
Time per request:       53.396 [ms] (mean)
Time per request:       2.670 [ms] (mean, across all concurrent requests)
Transfer rate:          454.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   13  24.4      7     110
Processing:     4   24  29.9     21     137
Waiting:        0    6  12.3      7     121
Total:          4   36  35.3     29     141

Percentage of the requests served within a certain time (ms)
  50%     29
  66%     30
  75%     30
  80%     30
  90%    115
  95%    123
  98%    130
  99%    141
 100%    141 (longest request)