boards/arm/tiac_magpie/doc/samples/net/dumb_http_server_mt_ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.10.199 (be patient).....done


Server Software:        
Server Hostname:        192.168.10.199
Server Port:            8080

Document Path:          /
Document Length:        2084 bytes

Concurrency Level:      50
Time taken for tests:   0.215 seconds
Complete requests:      100
Failed requests:        13
   (Connect: 0, Receive: 0, Length: 13, Exceptions: 0)
Total transferred:      186180 bytes
HTML transferred:       181308 bytes
Requests per second:    465.45 [#/sec] (mean)
Time per request:       107.424 [ms] (mean)
Time per request:       2.148 [ms] (mean, across all concurrent requests)
Transfer rate:          846.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.3      2       3
Processing:     2   23  57.5      5     209
Waiting:        0    9  34.8      3     209
Total:          4   24  57.7      6     212

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      6
  80%      6
  90%      9
  95%    206
  98%    209
  99%    212
 100%    212 (longest request)